___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 04</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Pandas DataFrames</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [DATA FRAMES](#1)
* [CREATING A DATA FRAME](#2)
    * [Creating a DataFrame Using the Lists of Data & Columns](#2.1)
    * [Creating a DataFrame Using a Numpy Arrays](#2.2)
    * [Creating a DataFrame Using a Dictionary](#2.3)
    * [The Examination of Some Attributes on Data](#2.4)
* [INDEXING, SLICING & SELECTION](#3)    
* [CREATING A NEW COLUMN](#4)    
* [REMOVING COLUMNS](#5)
* [REMOVING ROWS](#6)
* [SELECTING ROWS & COLUMNS USING .loc[ ] & .iloc[ ] ](#7)
* [CONDITIONAL SELECTION](#8)
    * [One Conditional Statement](#8.1)
    * [Two or More Conditional Statements](#8.2)
    * [Conditional Selection Using .loc[ ]](#8.3)
* [reset_index() & set_index()](#9)
* [Multi-Index & Index Hierarchy](#10)
* [Some Other Useful Methods with Iris Dataset](#11)
* [THE END OF THE SESSION-04](#12)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy & Pandas you can import them as a library:

In [2]:
import pandas as pd
import numpy as np

**view of a Pandas DataFrame:**

In [2]:
df = pd.read_csv("IMDB_top_1000_LV.csv")
df

,Movie_ID,Title,Certificate,Duration,Genre,Rate,Metascore,Description,Year,Directors,Stars,Votes,Gross($M)
0,1,The Shawshank Redemption,13+,142,Drama,9.3,80,Two imprisoned men bond over a number of years...,1994,Frank Darabont,"Tim Robbins, Morgan Freeman, Bob Gunton, Willi...",2377444,28.34
1,2,The Godfather,16,175,"Crime, Drama",9.2,100,An organized crime dynasty's aging patriarch t...,1972,Francis Ford Coppola,"Marlon Brando, Al Pacino, James Caan, Diane Ke...",1646788,134.97
2,3,The Dark Knight,16,152,"Action, Crime, Drama",9.0,84,When the menace known as the Joker wreaks havo...,2008,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart, M...",2341216,534.86
3,4,The Godfather: Part II,12,202,"Crime, Drama",9.0,90,The early life and career of Vito Corleone in ...,1974,Francis Ford Coppola,"Al Pacino, Robert De Niro, Robert Duvall, Dian...",1146645,57.30
4,5,12 Angry Men,14,96,"Crime, Drama",9.0,96,A jury holdout attempts to prevent a miscarria...,1957,Sidney Lumet,"Henry Fonda, Lee J. Cobb, Martin Balsam, John ...",701877,4.36
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Breakfast at Tiffany's,AL,115,"Comedy, Drama, Romance",7.6,76,A young New York socialite becomes interested ...,1961,Blake Edwards,"Audrey Hepburn, George Peppard, Patricia Neal,...",168708,0.00
996,997,Giant,G,201,"Drama, Western",7.6,84,Sprawling epic covering the life of a Texas ca...,1956,George Stevens,"Elizabeth Taylor, Rock Hudson, James Dean, Car...",34593,0.00
997,998,From Here to Eternity,12,118,"Drama, Romance, War",7.6,85,"In Hawaii in 1941, a private is cruelly punish...",1953,Fred Zinnemann,"Burt Lancaster, Montgomery Clift, Deborah Kerr...",43867,30.50
998,999,Lifeboat,None,97,"Drama, War",7.6,78,Several survivors of a torpedoed merchant ship...,1944,Alfred Hitchcock,"Tallulah Bankhead, John Hodiak, Walter Slezak,...",26791,0.00
999,1000,The 39 Steps,14,86,"Crime, Mystery, Thriller",7.6,93,A man in London tries to help a counter-espion...,1935,Alfred Hitchcock,"Robert Donat, Madeleine Carroll, Lucie Mannhei...",52686,0.00

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Data Frames</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A DataFrame is a two-dimensional data container, similar to a Matrix, but which can contain heterogeneous data, and for which symbolic names may be associated with the rows and columns. ``DataFrames`` are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. 

### Why use Pandas?

Data scientists make use of Pandas in Python for its **following advantages**:

- Easily handles missing data
- It uses Series for one-dimensional data structure and DataFrame for multi-dimensional data structure
- It provides an efficient way to slice the data
- It provides a flexible way to merge, concatenate or reshape the data
- It includes a powerful time series tool to work with

In a nutshell, Pandas is a useful library in data analysis. It can be used to perform data manipulation and analysis. Pandas provide powerful and easy-to-use data structures, as well as the means to quickly perform operations on these structures.

[SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html), 
[SOURCE02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html), 
[SOURCE03](https://morioh.com/p/2528ac775b1b), 
[SOURCE04](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python), 
[SOURCE05](https://www.guru99.com/python-pandas-tutorial.html), 
[SOURCE06](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm), 
[SOURCE07](https://realpython.com/pandas-dataframe/) &
[SOURCE08](https://towardsdatascience.com/a-simple-guide-to-pandas-dataframes-b125f64e1453)<br>
[VIDEO SOURCE01](https://www.youtube.com/watch?v=zmdjNSmRXF4), 
[VIDEO SOURCE02](https://www.youtube.com/watch?v=F6kmIpWWEdU) &
[VIDEO SOURCE03](https://towardsdatascience.com/pandas-dataframe-basics-3c16eb35c4f3)<br>

**Now let's use pandas to explore this topic!**

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a DataFrame</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A **``DataFrame``** is a **two-dimension collection of data**. It is a data structure where data is stored in **tabular form**. Datasets are arranged in rows and columns; we can store multiple datasets in the data frame. We can perform various arithmetic operations, such as adding column/row selection and columns/rows in the data frame.

We can import the DataFrames from the external storage; these storages can be referred to as the SQL Database, CSV file, and an Excel file. We can also use the lists, dictionary, and from a list of dictionary, etc.

In this session, we will learn to create the DataFrame in multiple ways. Let's understand these different ways.

**``pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)``**

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using the Lists of Data & Columns</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [8]:
my_data = [1, 3, 5, 7, 9, 18]
data

[1, 3, 5, 7, 9, 18]

In [15]:
pd.DataFrame(data = my_data)

    0
0   1
1   3
2   5
3   7
4   9
5  18

In [19]:
pd.DataFrame(data = my_data, columns = ['column1'])

   column1
0        1
1        3
2        5
3        7
4        9
5       18

In [14]:
pd.Series(data = my_data, name = 'column1')

0     1
1     3
2     5
3     7
4     9
5    18
Name: column1, dtype: int64

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Numpy Arrays</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [17]:
arr_data = np.arange(1, 24, 2).reshape(3, 4)
arr_data

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [21]:
df = pd.DataFrame(data = arr_data, columns = "var1 var2 var3 var4".split())
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Dictionary</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [16]:
s1 = np.random.randint(2, 10, size = 4)
s2 = np.random.randint(3, 10, size = 4)
s3 = np.random.randint(4, 15, size = 4)

In [24]:
s1

array([5, 9, 9, 2])

In [25]:
s2

array([4, 5, 8, 8])

In [26]:
s3

array([11,  9,  6,  4])

In [17]:
myDict = {'var1' : s1,
          'var2' : s2,
          'var3' : s3}

In [29]:
df = pd.DataFrame(myDict)
df

   var1  var2  var3
0     5     4    11
1     9     5     9
2     9     8     6
3     2     8     4

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">The Examination of Some Attributes on Data</p>

<a id="2.4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [31]:
df.head(2)

   var1  var2  var3
0     5     4    11
1     9     5     9

In [32]:
df.tail(2)

   var1  var2  var3
2     9     8     6
3     2     8     4

In [35]:
df.sample()

   var1  var2  var3
0     5     4    11

In [41]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [56]:
[i for i in df.columns]

['var1', 'var2', 'var3']

In [43]:
for i in df.columns:
    print(i)

var1
var2
var3

In [48]:
myDict['var1']

array([5, 9, 9, 2])

In [49]:
df.var1

0    5
1    9
2    9
3    2
Name: var1, dtype: int32

In [51]:
for i in df.columns:
    print(df[i].mean())

6.25
6.25
7.5

In [52]:
df.mean()

var1    6.25
var2    6.25
var3    7.50
dtype: float64

In [53]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [54]:
[i for i in df.index]

[0, 1, 2, 3]

In [59]:
df.columns = "new new2 new3".split()
df

   new  new2  new3
0    5     4    11
1    9     5     9
2    9     8     6
3    2     8     4

In [60]:
df.index = "a b c d".split()
df

   new  new2  new3
a    5     4    11
b    9     5     9
c    9     8     6
d    2     8     4

In [63]:
df.rename(columns = {'new2' : 'old2', 'new3' : 'old3'})
# kalıcı degıldır. Hepsine mudahale etmek zorunda degılız

   new  old2  old3
a    5     4    11
b    9     5     9
c    9     8     6
d    2     8     4

In [66]:
df.rename(index = {'a' : 1, 'b' : 2})
# kalıcı degıldır. Hepsine mudahale etmek zorunda degılız

   new  new2  new3
1    5     4    11
2    9     5     9
c    9     8     6
d    2     8     4

In [64]:
df

   new  new2  new3
a    5     4    11
b    9     5     9
c    9     8     6
d    2     8     4

In [67]:
df.shape

(4, 3)

In [69]:
number_of_rows = df.shape[0]
number_of_rows

4

In [70]:
df.ndim

2

In [71]:
df.values

array([[ 5,  4, 11],
       [ 9,  5,  9],
       [ 9,  8,  6],
       [ 2,  8,  4]])

In [72]:
df.size

12

In [73]:
type(df)

pandas.core.frame.DataFrame

In [74]:
type(df.values)

numpy.ndarray

In [75]:
type(df.index)

pandas.core.indexes.base.Index

In [77]:
type(df['new'])

pandas.core.series.Series

In [78]:
"new2" in df
#keylerde arar

True

In [79]:
"new5" in df

False

In [80]:
'c' in df

False

In [81]:
'c' in df.index

True

In [82]:
df.new

a    5
b    9
c    9
d    2
Name: new, dtype: int32

In [84]:
df['new']

a    5
b    9
c    9
d    2
Name: new, dtype: int32

In [83]:
df[['new']]
# liste içine koyarsak df tipinde getirir

   new
a    5
b    9
c    9
d    2

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Indexing, Slicing & Selection</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's learn a variety of methods to grab data from a DataFrame

In [3]:
# creating a DataFrame by "keyword arguments"

np.random.seed(101)
df = pd.DataFrame(np.random.randn(5, 4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [7]:
type(df['Y'])

pandas.core.series.Series

In [4]:
df[['Y']]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [5]:
type(df[['Y']])

pandas.core.frame.DataFrame

In [8]:
df[['X', 'Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [10]:
df['X' : 'Z']
# slicelama varsa indexleri slicelar column'ları slicelamaz

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [ ]:
df['A']
# Hata verir satır ismini çağıramayız

In [18]:
myDict

{'var1': array([9, 4, 6, 2]),
 'var2': array([9, 9, 4, 7]),
 'var3': array([ 6, 11, 11, 11])}

In [19]:
myDict['var3']

array([ 6, 11, 11, 11])

In [20]:
df['A' : 'C']
#label index oldugu için sonuncu index('C') dahildir

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [25]:
df['A' : 'C'][['W' , 'Z']]
#sütünlar virgülle ayırarak
#satırlar slicelayarak

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001

In [26]:
df[['W' , 'Z']]['A' : 'C']

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a New Column</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df['Q'] = df['X'] * df['Y']

In [48]:
df

          W         X         Y         Z         Q
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [49]:
df['J'] = np.arange(5)

In [50]:
df

          W         X         Y         Z         Q  J
A  2.706850  0.628133  0.907969  0.503826  0.570325  0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  1
C -2.018168  0.740122  0.528813 -0.589001  0.391387  2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  3
E  0.190794  1.978757  2.605967  0.683509  5.156577  4

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Columns</p>

<a id="5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [32]:
df.drop('J', axis = 1)
# kalıcı degildir. inplace = True kalıcı yapar

          W         X         Y         Z         Q
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Rows</p>

<a id="6"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [38]:
df

          W         X         Y         Z         Q  J
A  2.706850  0.628133  0.907969  0.503826  0.570325  0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  1
C -2.018168  0.740122  0.528813 -0.589001  0.391387  2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  3
E  0.190794  1.978757  2.605967  0.683509  5.156577  4

In [51]:
df.drop(columns = ['Q', 'J'], inplace = True)
#columns olarak girdiğimiz için axis = 1 dememize gerek yok

In [52]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df.drop('C')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df.drop(index = ['B', 'C'])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df_temp = df.drop('C')

In [54]:
df_temp

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Selecting Rows and Columns using .loc[ ] and iloc[ ]</p>

<a id="7"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

#### `.loc[]` → allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]` → allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [161]:
data = np.random.randint(1, 40, size=(8, 4))

df = pd.DataFrame(data, columns = ["var1", "var2", "var3", 'var4'])
df

   var1  var2  var3  var4
0     9    23    27    24
1    38    23    10     3
2    19    29    12    11
3    31    36    29     4
4    20    21    15     6
5     6     7    25    38
6     8    38     5    24
7    36    16    35     4

In [68]:
df.loc[4]
#loc[row, col]

var1     9
var2    23
var3    27
var4    24
Name: 4, dtype: int32

In [72]:
df.loc[[4]]

   var1  var2  var3  var4
4     9    23    27    24

In [73]:
df.loc[2:5]
#loc labellarda çalıstıgı ıcın 5 inclusive

   var1  var2  var3  var4
2    25    37    20    36
3    31    11    21    28
4     9    23    27    24
5    38    23    10     3

In [74]:
df.index = 'a b c d e f g h'.split()

In [75]:
df

   var1  var2  var3  var4
a    16     1    13    18
b    12    16    34    30
c    25    37    20    36
d    31    11    21    28
e     9    23    27    24
f    38    23    10     3
g    19    29    12    11
h    31    36    29     4

In [76]:
df.iloc[1:4]

   var1  var2  var3  var4
b    12    16    34    30
c    25    37    20    36
d    31    11    21    28

In [77]:
df.loc['b':'d']

   var1  var2  var3  var4
b    12    16    34    30
c    25    37    20    36
d    31    11    21    28

In [78]:
df.iloc[3,2]

21

In [81]:
df.loc['d':'g', 'var2']

d    11
e    23
f    23
g    29
Name: var2, dtype: int32

In [83]:
df.loc['d':'g']['var2']

d    11
e    23
f    23
g    29
Name: var2, dtype: int32

In [88]:
df.loc['d':'g',['var2']]

   var2
d    11
e    23
f    23
g    29

In [ ]:
df.loc[['d':'g']]['var2']
# hata verir. Df olarak göstermek için sadece sutunu çift parantez alabılırız

In [162]:
df.iloc[[0, 2], [0, 2]]

   var1  var3
0     9    27
2    19    12

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Conditional Selection</p>

<a id="8"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [89]:
df

   var1  var2  var3  var4
a    16     1    13    18
b    12    16    34    30
c    25    37    20    36
d    31    11    21    28
e     9    23    27    24
f    38    23    10     3
g    19    29    12    11
h    31    36    29     4

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">One Conditional Statement</p>

<a id="8.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [90]:
df > 9

    var1   var2  var3   var4
a   True  False  True   True
b   True   True  True   True
c   True   True  True   True
d   True   True  True   True
e  False   True  True   True
f   True   True  True  False
g   True   True  True   True
h   True   True  True  False

In [97]:
df[df > 13]

   var1  var2  var3  var4
a  16.0   NaN   NaN  18.0
b   NaN  16.0  34.0  30.0
c  25.0  37.0  20.0  36.0
d  31.0   NaN  21.0  28.0
e   NaN  23.0  27.0  24.0
f  38.0  23.0   NaN   NaN
g  19.0  29.0   NaN   NaN
h  31.0  36.0  29.0   NaN

In [98]:
df[df['var1'] > 13]
#b ve e satırını getirmedi

   var1  var2  var3  var4
a    16     1    13    18
c    25    37    20    36
d    31    11    21    28
f    38    23    10     3
g    19    29    12    11
h    31    36    29     4

In [102]:
df[df['var1'] > 13]['var2']

a     1
c    37
d    11
f    23
g    29
h    36
Name: var2, dtype: int32

In [104]:
df[df['var1'] > 13][['var2', 'var3']]

   var2  var3
a     1    13
c    37    20
d    11    21
f    23    10
g    29    12
h    36    29

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Two or More Conditional Statements</p>

<a id="8.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**For two or more conditions, you can use | → or, & → and with parenthesis:**

In [110]:
(df['var1']  > 10) & (df['var2'] < 20)

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h    False
dtype: bool

In [111]:
df[(df['var1']  > 10) & (df['var2'] < 20)]

   var1  var2  var3  var4
a    16     1    13    18
b    12    16    34    30
d    31    11    21    28

In [112]:
df[(df['var1']  > 10) & (df['var2'] < 20)][['var3', 'var4']]

   var3  var4
a    13    18
b    34    30
d    21    28

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Conditional Selection Using .loc[ ] and .iloc[ ]</p>

<a id="8.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [114]:
df.loc['a':'f']

   var1  var2  var3  var4
a    16     1    13    18
b    12    16    34    30
c    25    37    20    36
d    31    11    21    28
e     9    23    27    24
f    38    23    10     3

In [116]:
df.loc[['a','f'], ['var1', 'var4']]

   var1  var4
a    16    18
f    38     3

In [120]:
df.loc[((df['var1'] > 13) & (df['var1'] < 30)), ['var2', 'var3']]

   var2  var3
a     1    13
c    37    20
g    29    12

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">reset_index() & set_index()</p>

<a id="9"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [121]:
df

   var1  var2  var3  var4
a    16     1    13    18
b    12    16    34    30
c    25    37    20    36
d    31    11    21    28
e     9    23    27    24
f    38    23    10     3
g    19    29    12    11
h    31    36    29     4

In [122]:
df.reset_index()
#eski indexi satır haline getirdi

  index  var1  var2  var3  var4
0     a    16     1    13    18
1     b    12    16    34    30
2     c    25    37    20    36
3     d    31    11    21    28
4     e     9    23    27    24
5     f    38    23    10     3
6     g    19    29    12    11
7     h    31    36    29     4

In [123]:
df.reset_index(drop = True)
#getirmedi

   var1  var2  var3  var4
0    16     1    13    18
1    12    16    34    30
2    25    37    20    36
3    31    11    21    28
4     9    23    27    24
5    38    23    10     3
6    19    29    12    11
7    31    36    29     4

In [124]:
df.reset_index(drop = True, inplace = True)
# kalıcı hale getirdi

In [125]:
df

   var1  var2  var3  var4
0    16     1    13    18
1    12    16    34    30
2    25    37    20    36
3    31    11    21    28
4     9    23    27    24
5    38    23    10     3
6    19    29    12    11
7    31    36    29     4

In [126]:
df.set_index('var4')
# herhangi bir sutunu index yapabılıyoruz

      var1  var2  var3
var4
18      16     1    13
30      12    16    34
36      25    37    20
28      31    11    21
24       9    23    27
3       38    23    10
11      19    29    12
4       31    36    29

In [127]:
df.set_index('var3', drop = False)

      var1  var2  var3  var4
var3
13      16     1    13    18
34      12    16    34    30
20      25    37    20    36
21      31    11    21    28
27       9    23    27    24
10      38    23    10     3
12      19    29    12    11
29      31    36    29     4

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Multi-Index & Index Hierarchy</p>

<a id="10"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [129]:
# Index Levels

outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [130]:
pd.MultiIndex.from_tuples(multi_index)

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [131]:
hier_index = pd.MultiIndex.from_tuples(multi_index)

In [134]:
np.random.seed(101)

df = pd.DataFrame(np.random.randn(9,4), index = hier_index, columns = 'A B C D'.split())
df

             A         B         C         D
M1 1  2.706850  0.628133  0.907969  0.503826
   2  0.651118 -0.319318 -0.848077  0.605965
   3 -2.018168  0.740122  0.528813 -0.589001
M2 1  0.188695 -0.758872 -0.933237  0.955057
   2  0.190794  1.978757  2.605967  0.683509
   3  0.302665  1.693723 -1.706086 -1.159119
M3 5 -0.134841  0.390528  0.166905  0.184502
   6  0.807706  0.072960  0.638787  0.329646
   7 -0.497104 -0.754070 -0.943406  0.484752

In [136]:
df.index.names
# isimleri yok

FrozenList([None, None])

In [137]:
df.index.names = ['Group', 'Num']

In [138]:
df.index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           names=['Group', 'Num'])

In [139]:
df.index.levels

FrozenList([['M1', 'M2', 'M3'], [1, 2, 3, 5, 6, 7]])

In [142]:
df.index.get_level_values

<bound method MultiIndex.get_level_values of MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           names=['Group', 'Num'])>

In [143]:
df.index.get_level_values(0)

Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

In [144]:
df.index.get_level_values(1)

Int64Index([1, 2, 3, 1, 2, 3, 5, 6, 7], dtype='int64', name='Num')

In [145]:
df.index.get_level_values('Group')

Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

In [146]:
df[['A', 'B']]

                  A         B
Group Num
M1    1    2.706850  0.628133
      2    0.651118 -0.319318
      3   -2.018168  0.740122
M2    1    0.188695 -0.758872
      2    0.190794  1.978757
      3    0.302665  1.693723
M3    5   -0.134841  0.390528
      6    0.807706  0.072960
      7   -0.497104 -0.754070

In [147]:
df.loc['M1']

            A         B         C         D
Num
1    2.706850  0.628133  0.907969  0.503826
2    0.651118 -0.319318 -0.848077  0.605965
3   -2.018168  0.740122  0.528813 -0.589001

In [148]:
df.loc['M1'].index

Int64Index([1, 2, 3], dtype='int64', name='Num')

In [149]:
df.loc[('M1', 2)]

A    0.651118
B   -0.319318
C   -0.848077
D    0.605965
Name: (M1, 2), dtype: float64

In [150]:
df.loc['M1', 'A' : 'C']

            A         B         C
Num
1    2.706850  0.628133  0.907969
2    0.651118 -0.319318 -0.848077
3   -2.018168  0.740122  0.528813

In [151]:
df.loc[[('M1', 2)], 'A' : 'C']

                  A         B         C
Group Num
M1    2    0.651118 -0.319318 -0.848077

In [152]:
df.loc['M1':'M2']

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

In [153]:
df.loc[('M1', 2) : ('M2', 3)]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

In [154]:
df.loc[('M1', 2) : 'M2']

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

In [157]:
df.loc[[('M2', 3) , ('M3', 5)]]

                  A         B         C         D
Group Num
M2    3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502

In [159]:
df.loc[[('M2', 3) , ('M3', 5)],['A']]

                  A
Group Num
M2    3    0.302665
M3    5   -0.134841

**``Note``** that all of the MultiIndex constructors accept a names argument which stores string names for the levels themselves. If no names are provided, None will be assigned:

For more information Indexing and Selecting Data, visit [**Pandas Official Documentation**](https://pandas.pydata.org/pandas-docs/version/0.13.0/indexing.html)

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

In [ ]:
df.loc[[("M2", 3), ("M3", 5)]]

                  A         B         C         D
Group Num
M2    3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502

More information for Multiindex and Advanced Indexing, visit [**Pandas Official Documentation**](https://pandas.pydata.org/docs/user_guide/advanced.html)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Some Other Useful Methods with Iris Dataset</p>

<a id="11"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

### Let's apply functions/attributes/methods we have learnt for "iris dataset"

In [163]:
import seaborn as sns

In [164]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [165]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [166]:
df.shape

(150, 5)

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [169]:
df.sample(4)

     sepal_length  sepal_width  petal_length  petal_width     species
58            6.6          2.9           4.6          1.3  versicolor
83            6.0          2.7           5.1          1.6  versicolor
69            5.6          2.5           3.9          1.1  versicolor
124           6.7          3.3           5.7          2.1   virginica

In [170]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [171]:
df.describe().transpose()

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [173]:
df.describe(include = 'all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [174]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [175]:
df.corr()['sepal_width']

sepal_length   -0.117570
sepal_width     1.000000
petal_length   -0.428440
petal_width    -0.366126
Name: sepal_width, dtype: float64

In [176]:
df.corr()[['sepal_width']]

              sepal_width
sepal_length    -0.117570
sepal_width      1.000000
petal_length    -0.428440
petal_width     -0.366126

In [177]:
df.petal_length.corr(df.petal_width)

0.9628654314027963

In [178]:
df.species.value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [180]:
df.species.value_counts(dropna = False)
# null deger yok

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [181]:
df.species.value_counts(normalize = True)

setosa        0.333333
versicolor    0.333333
virginica     0.333333
Name: species, dtype: float64

In [182]:
df.species.value_counts(normalize = True) * 100
# Yüzdelik

setosa        33.333333
versicolor    33.333333
virginica     33.333333
Name: species, dtype: float64

In [183]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [184]:
df.species.nunique()

3

In [185]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [191]:
df.loc[df["species"] == "setosa", "sepal_length"]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [194]:
df[(df.sepal_length > 4) & (df.sepal_length < 5)]

     sepal_length  sepal_width  petal_length  petal_width     species
1             4.9          3.0           1.4          0.2      setosa
2             4.7          3.2           1.3          0.2      setosa
3             4.6          3.1           1.5          0.2      setosa
6             4.6          3.4           1.4          0.3      setosa
8             4.4          2.9           1.4          0.2      setosa
9             4.9          3.1           1.5          0.1      setosa
11            4.8          3.4           1.6          0.2      setosa
12            4.8          3.0           1.4          0.1      setosa
13            4.3          3.0           1.1          0.1      setosa
22            4.6          3.6           1.0          0.2      setosa
24            4.8          3.4           1.9          0.2      setosa
29            4.7          3.2           1.6          0.2      setosa
30            4.8          3.1           1.6          0.2      setosa
34            4.9          3.1           1.5          0.2      setosa
37            4.9          3.6           1.4          0.1      setosa
38            4.4          3.0           1.3          0.2      setosa
41            4.5          2.3           1.3          0.3      setosa
42            4.4          3.2           1.3          0.2      setosa
45            4.8          3.0           1.4          0.3      setosa
47            4.6          3.2           1.4          0.2      setosa
57            4.9          2.4           3.3          1.0  versicolor
106           4.9          2.5           4.5          1.7   virginica

In [198]:
df[(df.species == 'virginica') & (df.sepal_length > 4) & (df.sepal_length < 5)]

     sepal_length  sepal_width  petal_length  petal_width    species
106           4.9          2.5           4.5          1.7  virginica

In [199]:
df.sort_values(by = 'sepal_length')

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [200]:
df.sort_values(by = 'sepal_length', ascending = True)

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of The Session - 04</p>

<a id="12"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

________